The element has an open connector
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId OpenConnector { get; }
  Visual Basic
Public Shared ReadOnly Property OpenConnector As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ OpenConnector {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures ConnectorFailures Class
  Autodesk.Revit.DB Namespace